// @ts-nocheck
import React from "react";
import { Chart as ChartJS, ArcElement, Tooltip, Legend } from "chart.js";
import { Pie } from "react-chartjs-2";


ChartJS.register(Tooltip, Legend, ArcElement);

const PieChart = () => {

  let data = {
    
    labels: [
      "-Ургамлын гаралтай бүтээгдэхүүн",
      "-Хүнсний бэлэн бүтээгдэхүүн",
      "-Химийн ба түүнтэй холбоотой үйлдвэрийн бүтээгдэхүүн",
      "-Хуванцар ба түүгээр хийсэн зүйлс, хаймар ,каучук ба түүгээр хийсэн зүйлс",
      "-Арьс, ширэн түүхий эд , боловсруулсан арьс шир, үслэг арьс ба тэдгээрээр хийсэн эдлэл,суран ба тоног хэрэгсэл, аяны хэрэгсэл, түүнтэй төстэй ууь сав",
      "-Мод ба модон эдлэл , модны нүүрс, үйс ба үйсэн эдлэл, сүрлэн, сийрсэн буюу сүлжих бусад материалаар хийсэн зүйлс, сагсан зүйлс ",
      "-Нэхмэлийн материал ба нэхмэл эдлэл",
      "-Гутал, малгай ,шүхэр ,нарны халхавч,таяг,тулгуур,шилбүүр,ташуур болон тэдгээрийн эд анги , боловсруулсан өд, ноолуур, тэдгээртэй хамт хийсэн зүйлс, хиймэл цэцэг",
    ],
    datasets: [
      {
        label: "# of Votes",
        data: [12, 19, 3, 9, 2, 3, 10, 15],
        backgroundColor: [
          "rgba(154, 162, 235, 2)",
          "rgba(255, 206, 86, 2)",
          "rgba(75, 192, 192, 2)",
          "rgba(153, 102, 255, 2)",
          "rgba(5, 159, 64, 2)",
          "rgba(55, 59, 164, 42)",
          "rgba(130, 59, 34, 99)",
          "rgba(24, 129, 364, 22)",
        ],
        borderColor: [
          "rgba(154, 162, 235, 2)",
          "rgba(255, 206, 86, 2)",
          "rgba(75, 192, 192, 2)",
          "rgba(153, 102, 255, 2)",
          "rgba(5, 159, 64, 2)",
          "rgba(55, 59, 164, 42)",
          "rgba(130, 59, 34, 99)",
          "rgba(24, 129, 364, 22)",
        ],
        borderWidth: 1,
      },
    ],
  };

  const options = {
    responsive: true,
    legend: {
      labels: {
        fontSize: 4,
      },
    },
  };

  return (
    <div className="piechart">
      <Pie  data={data} height={2} options={options} />
    </div>
  );
};

export default PieChart;
