// @ts-nocheck
import React from "react";


const AboutUsText = () => {
  return (
    <div className="aboutUsText">
      <h3 className="aboutUsText__title">БИДНИЙ БҮТЭЦ ЗОХИОН БАЙГУУЛАЛТ</h3>

      <p>
        Бид ачаа тээвэр зохицуулалтын чиглэлээр нээлттэй, олон нийтийн компани
        буюу хувьцаат компанийн зохион байгуулалтаар ажиллаж байна. Үндсэн 500
        гишүүн, энгийн 100,000 гаруй гишүүн элсүүлхээр ажиллаж байна.
      </p>

      <p>
        Энэхүү үйл ажиллагаа хүн бүрт нээлттэй бөгөөд Эрхэм таныг "Ардын Ачаа
        Нэгдэл"-д нэгдэхийг урьж байна. Бид ачаа тээврийн чиглэлээр үйл
        ажиллагаа эрхэлж ирсэн карго, тээвэр зууч, онлайн худалдаа эрхлэгчидтэй
        хамтран ажиллаж нэгдмэл нэг зорилго тавин ажиллаж байгаа тул та бүхнийг
        бидний үйл ажиллагаанд идэвхитэй хамтран ажиллахыг урьж байна.
      </p>

      <p>
        <b>Бидний гол зорилго:</b> Ачаа тээврийн ухаалаг дэд бүтэц, үнийн
        тогтвортой байдал, нийтийн хяналт оролцоог бий болгох замаар салбарын
        тэргүүлэгч байгуулага болох болно.
      </p>
    </div>
  );
};

export default AboutUsText;
